Revit 2026 API

# BuiltInDockablePanes Properties

---

The DockablePanesBuiltInDockablePanes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ContentDelivery | The content delivery pane. |
|  | ElementView | The element view pane. |
|  | FabricationPartBrowser | The Fabrication part browser pane. |
|  | HostByLinkNavigator | The host by link navigator pane. |
|  | PnIdModelerBrowser | The P&ID modeler browser pane. |
|  | ProjectBrowser | The project browser pane. |
|  | PropertiesPalette | The properties palette pane. |
|  | RebarBrowser | The rebar browser pane. |
|  | SharedViews | The shared view pane. |
|  | SystemNavigator | The system browser pane. |
|  | ViewBrowser | The View browser pane. |

#### Reference

DockablePanesBuiltInDockablePanes Class

Autodesk.Revit.UI Namespace